In [1]:
import pandas as pd

C:\Users\Diego Miranda\anaconda3\lib\site-packages\pandas\core\computation\expressions.py:20: UserWarning: Pandas requires version '2.7.3' or newer of 'numexpr' (version '2.7.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

In [2]:
data = pd.read_excel("Salary_Data.xlsx")
data.head(10)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0

In [3]:
data.shape

(6704, 6)

In [4]:
data.dtypes

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

In [5]:
data.describe()

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

In [6]:
data = data.rename(columns={"Age":"Edad","Gender":"Género","Education Level":"Escolaridad", 
                            "Job Title":"Título", "Years of Experience": "Años Experiencia", "Salary":"Sueldo"})
data.head()

   Edad  Género Escolaridad             Título  Años Experiencia    Sueldo
0  32.0    Male  Bachelor's  Software Engineer               5.0   90000.0
1  28.0  Female    Master's       Data Analyst               3.0   65000.0
2  45.0    Male         PhD     Senior Manager              15.0  150000.0
3  36.0  Female  Bachelor's    Sales Associate               7.0   60000.0
4  52.0    Male    Master's           Director              20.0  200000.0

In [7]:
data.groupby("Título").size()

Título
Account Manager               1
Accountant                    1
Administrative Assistant      2
Back end Developer          244
Business Analyst              2
                           ...
UX Designer                   1
UX Researcher                 1
VP of Finance                 1
VP of Operations              1
Web Developer                87
Length: 193, dtype: int64

In [9]:
data.groupby("Escolaridad").size()

Escolaridad
Bachelor's            756
Bachelor's Degree    2267
High School           448
Master's              288
Master's Degree      1573
PhD                  1368
phD                     1
dtype: int64

In [10]:
subset = data[["Edad","Años Experiencia", "Sueldo"]]
subset.head()

   Edad  Años Experiencia    Sueldo
0  32.0               5.0   90000.0
1  28.0               3.0   65000.0
2  45.0              15.0  150000.0
3  36.0               7.0   60000.0
4  52.0              20.0  200000.0

In [11]:
subset = subset["Sueldo"]>5000
subset.head()

0    True
1    True
2    True
3    True
4    True
Name: Sueldo, dtype: bool

In [12]:
df = pd.read_excel("Salary_corrupta.xlsx")
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [13]:
df.isnull().sum()

Age                     2
Gender                  2
Education Level         3
Job Title               2
Years of Experience     3
Salary                 50
dtype: int64

In [15]:
df.dtypes

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

In [18]:
df["Age"] = df["Age"].fillna(df["Age"].mean())
df["Years of Experience"] = df["Years of Experience"].fillna(df["Years of Experience"].mean())
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())

In [19]:
df.isnull().sum()

Age                    0
Gender                 2
Education Level        3
Job Title              2
Years of Experience    0
Salary                 0
dtype: int64